kairkiss/mac-esp32-console/esp32/bkb_desk_pet_v6_lite/bkb_desk_pet_v6_lite.ino
/*
  Mac-esp32 Console Pet Runtime v6 Lite
  ESP32 OLED pet runtime + 5V fan PWM controller.

  Main path:
    Mac Brain -> bkb/desk1/mac/state + heartbeat + pet/config
    ESP32 owns face animation, display policy, fan control, and failsafe.

  Compatibility:
    v5 desired/system, desired/face, desired/display are parsed defensively.
    They are not the primary control path and cannot permanently override v6.

  Hardware safety:
    ESP32 GPIO must NOT drive a 5V fan directly. Use MOSFET/transistor,
    external 5V power, and shared GND. GPIO25 is PWM signal only.
*/

#include <WiFi.h>
#include <WebServer.h>
#include <Preferences.h>
#include <PubSubClient.h>
#include <ArduinoJson.h>
#include <U8g2lib.h>
#include <SPI.h>
#include <Update.h>
#include "mbedtls/base64.h"

// ========================= Config =========================
namespace Config {
const char* WIFI_SSID = "YOUR_WIFI_SSID";
const char* WIFI_PASS = "YOUR_WIFI_PASSWORD";
const char* MQTT_HOST = "192.168.1.100";
const int MQTT_PORT = 1883;
const char* DEVICE_ID = "desk1";
const char* FW_NAME = "v6.4-control-center";
const char* FW_VERSION = "v7.0.0-alpha1";
const char* CONFIG_AP_SSID = "MacESP32-Setup";
const char* CONFIG_AP_PASS = "macesp32";

const uint8_t OLED_CS = 33;
const uint8_t OLED_DC = 27;
const uint8_t OLED_RST = 26;

// GPIO25 was BTN2 in v5. v6 Lite disables button interaction, so it is free for fan PWM.
const uint8_t FAN_PWM_PIN = 25;
const uint8_t FAN_PWM_CHANNEL = 0;
const uint32_t FAN_PWM_FREQ = 25000;
const uint8_t FAN_PWM_BITS = 8;

const unsigned long MAC_STATE_STALE_MS = 10000;
const unsigned long MAC_LONG_OFFLINE_MS = 60000;
const unsigned long HEARTBEAT_STALE_MS = 10000;
const unsigned long PET_STATE_MS = 10000;
const unsigned long TELEMETRY_MS = 30000;
const unsigned long LEGACY_ONLINE_MS = 5000;
const unsigned long FACE_FRAME_MS = 130;
const unsigned long FAN_UPDATE_MS = 200;
const unsigned long COMPAT_VIEW_MS = 6000;
const unsigned long SCENE_DEFAULT_MS = 5000;
const unsigned long MIN_BITMAP_PAGE_MS = 6000;
const unsigned long SLEEP_SCREEN_OFF_MS = 20UL * 60UL * 1000UL;
const unsigned long IDLE_SLEEPY_S = 10UL * 60UL;
const unsigned long MOOD_HOLD_MS = 1200;
const unsigned long HOT_COOLDOWN_MS = 30000;
const size_t BITMAP_1BPP_BYTES = 128 * 64 / 8;
const uint8_t MAX_BITMAP_PAGES = 8;

struct CurvePoint { int temp; int pct; };
const CurvePoint DEFAULT_FAN_CURVE[] = {
  {45, 0}, {55, 25}, {65, 40}, {75, 65}, {85, 85}, {95, 100}
};
const size_t FAN_CURVE_LEN = sizeof(DEFAULT_FAN_CURVE) / sizeof(DEFAULT_FAN_CURVE[0]);
}

// ========================= Shared Types =========================
enum Mood {
  MOOD_NORMAL,
  MOOD_HAPPY,
  MOOD_FOCUS,
  MOOD_BUSY,
  MOOD_POWER,
  MOOD_HOT,
  MOOD_IDLE,
  MOOD_SLEEPY,
  MOOD_SLEEP,
  MOOD_OFFLINE,
  MOOD_THINKING,
  MOOD_READING,
  MOOD_REPLYING,
  MOOD_CONFUSED
};

const char* moodName(Mood mood) {
  switch (mood) {
    case MOOD_NORMAL: return "normal";
    case MOOD_HAPPY: return "happy";
    case MOOD_FOCUS: return "focus";
    case MOOD_BUSY: return "busy";
    case MOOD_POWER: return "power";
    case MOOD_HOT: return "hot";
    case MOOD_IDLE: return "idle";
    case MOOD_SLEEPY: return "sleepy";
    case MOOD_SLEEP: return "sleep";
    case MOOD_OFFLINE: return "offline";
    case MOOD_THINKING: return "thinking";
    case MOOD_READING: return "reading";
    case MOOD_REPLYING: return "replying";
    case MOOD_CONFUSED: return "confused";
  }
  return "happy";
}

// ========================= NetworkConfig =========================
class NetworkConfig {
public:
  String wifiSsid = Config::WIFI_SSID;
  String wifiPass = Config::WIFI_PASS;
  String mqttHost = Config::MQTT_HOST;
  int mqttPort = Config::MQTT_PORT;

  void begin() {
    prefs.begin("bkb-net", false);
    wifiSsid = prefs.getString("ssid", Config::WIFI_SSID);
    wifiPass = prefs.getString("pass", Config::WIFI_PASS);
    mqttHost = prefs.getString("mqtt", Config::MQTT_HOST);
    mqttPort = prefs.getInt("port", Config::MQTT_PORT);
    if (mqttHost.length() == 0) {
      mqttHost = Config::MQTT_HOST;
      prefs.putString("mqtt", mqttHost);
    }
    if (wifiSsid.length() == 0) {
      wifiSsid = Config::WIFI_SSID;
      prefs.putString("ssid", wifiSsid);
    }
  }

  void save(const String& ssid, const String& pass, const String& host, int port) {
    if (ssid.length()) {
      wifiSsid = ssid;
      prefs.putString("ssid", wifiSsid);
    }
    if (pass.length()) {
      wifiPass = pass;
      prefs.putString("pass", wifiPass);
    }
    if (host.length()) {
      mqttHost = host;
      prefs.putString("mqtt", mqttHost);
    }
    if (port > 0 && port <= 65535) {
      mqttPort = port;
      prefs.putInt("port", mqttPort);
    }
  }

private:
  Preferences prefs;
};

// ========================= DisplayEngine =========================
class DisplayEngine {
public:
  U8G2_SSD1309_128X64_NONAME0_F_4W_HW_SPI oled;
  bool screenOn = true;
  bool textMode = false;
  String text[4] = {"Mac-esp32", "v6 Lite", "Booting", ""};

  DisplayEngine() : oled(U8G2_R0, Config::OLED_CS, Config::OLED_DC, Config::OLED_RST) {}

  void begin() {
    oled.begin();
    oled.setFont(u8g2_font_6x12_tr);
    drawText("Mac-esp32", "v6 Lite", "Starting", "ESP32");
  }

  void setScreen(bool on) {
    if (screenOn == on) return;
    screenOn = on;
    if (!screenOn) clear();
  }

  void clear() {
    oled.clearBuffer();
    oled.sendBuffer();
  }

  void drawText(const String& l0, const String& l1, const String& l2, const String& l3) {
    textMode = true;
    text[0] = fit16(l0); text[1] = fit16(l1); text[2] = fit16(l2); text[3] = fit16(l3);
    if (!screenOn) return;
    oled.clearBuffer();
    oled.setFont(u8g2_font_6x12_tr);
    oled.drawStr(0, 12, text[0].c_str());
    oled.drawStr(0, 28, text[1].c_str());
    oled.drawStr(0, 44, text[2].c_str());
    oled.drawStr(0, 60, text[3].c_str());
    oled.sendBuffer();
  }

  void drawConsoleText(const String& body, const String& style) {
    textMode = true;
    if (!screenOn) return;
    oled.clearBuffer();
    oled.setFont(u8g2_font_6x12_tr);

    int left = 0;
    int top = 0;
    int maxChars = 20;
    int maxLines = 5;
    if (style == "bubble") {
      oled.drawRFrame(2, 3, 124, 58, 6);
      left = 8;
      top = 13;
      maxChars = 18;
      maxLines = 4;
    } else if (style == "caption") {
      oled.drawHLine(0, 48, 128);
      left = 0;
      top = 12;
      maxChars = 20;
      maxLines = 3;
    } else {
      left = 0;
      top = 12;
      maxChars = 20;
      maxLines = 5;
    }

    String remaining = body;
    remaining.replace("\r", "");
    int y = top;
    for (int line = 0; line < maxLines && remaining.length() > 0; line++) {
      int newline = remaining.indexOf('\n');
      String chunk = newline >= 0 ? remaining.substring(0, newline) : remaining;
      if (chunk.length() > maxChars) chunk = chunk.substring(0, maxChars);
      oled.drawStr(left, y, chunk.c_str());
      int consumed = chunk.length();
      if (newline >= 0 && newline < consumed + 1) consumed = newline + 1;
      remaining = remaining.substring(min((int)remaining.length(), consumed));
      if (remaining.startsWith("\n")) remaining.remove(0, 1);
      y += 12;
    }
    oled.sendBuffer();
  }

