kairkiss/mac-esp32-console/esp32/bkb_desk_pet_v6_lite/bkb_desk_pet_v6_lite.ino
  void drawBitmap1bpp(const uint8_t* bitmap) {
    textMode = false;
    if (!screenOn) return;
    oled.clearBuffer();
    for (uint8_t y = 0; y < 64; y++) {
      for (uint8_t x = 0; x < 128; x++) {
        size_t idx = (size_t)y * 16 + (x >> 3);
        if (bitmap[idx] & (1 << (x & 7))) oled.drawPixel(x, y);
      }
    }
    oled.sendBuffer();
  }

  void beginFaceFrame() {
    textMode = false;
    if (!screenOn) return;
    oled.clearBuffer();
  }

  void endFaceFrame() {
    if (!screenOn) return;
    oled.sendBuffer();
  }

private:
  String fit16(const String& s) {
    return s.length() <= 16 ? s : s.substring(0, 16);
  }
};

// ========================= MacLink =========================
class MacLink {
public:
  bool locked = true;
  bool online = false;
  int idleS = 0;
  int cpuPct = 0;
  int memPct = 0;
  int tempC = -1;
  String app = "Unknown";
  String timeText = "--:--";
  String modeHint = "";
  unsigned long lastStateMs = 0;
  unsigned long lastHeartbeatMs = 0;

  void handleState(JsonDocument& doc) {
    online = doc["online"] | true;
    locked = doc["locked"] | locked;
    idleS = constrain((int)(doc["idle_s"] | idleS), 0, 86400);
    cpuPct = constrain((int)(doc["cpu_pct"] | cpuPct), 0, 100);
    memPct = constrain((int)(doc["mem_pct"] | memPct), 0, 100);
    if (doc["temp_c"].is<int>()) tempC = constrain((int)doc["temp_c"], 0, 120);
    else tempC = -1;
    app = doc["app"].is<const char*>() ? String(doc["app"].as<const char*>()) : app;
    timeText = doc["time"].is<const char*>() ? String(doc["time"].as<const char*>()) : timeText;
    modeHint = doc["mode_hint"].is<const char*>() ? String(doc["mode_hint"].as<const char*>()) : "";
    lastStateMs = millis();
    lastHeartbeatMs = millis();
  }

  void handleHeartbeat(JsonDocument& doc) {
    online = doc["online"] | true;
    lastHeartbeatMs = millis();
  }

  bool hasState() const { return lastStateMs > 0; }
  bool stateFresh() const { return hasState() && millis() - lastStateMs <= Config::MAC_STATE_STALE_MS; }
  bool heartbeatFresh() const { return lastHeartbeatMs > 0 && millis() - lastHeartbeatMs <= Config::HEARTBEAT_STALE_MS; }
  bool macAvailable() const { return online && (stateFresh() || heartbeatFresh()); }
  bool longOffline() const { return !hasState() || millis() - lastStateMs > Config::MAC_LONG_OFFLINE_MS; }
  bool tempValid() const { return tempC >= 10 && tempC <= 110 && stateFresh(); }
  unsigned long stateAgeMs() const { return hasState() ? millis() - lastStateMs : 0xFFFFFFFF; }
};

// ========================= Runtime Config =========================
class RuntimeConfig {
public:
  bool lockedScreenOff = true;
  bool offlineFace = true;
  bool nightIdleOff = true;
  unsigned long sleepScreenOffMs = Config::SLEEP_SCREEN_OFF_MS;
  String fanMode = "auto";
  int offlinePct = 20;
  int failsafePct = 80;
  Config::CurvePoint curve[8];
  size_t curveLen = Config::FAN_CURVE_LEN;

  void begin() {
    for (size_t i = 0; i < Config::FAN_CURVE_LEN; i++) curve[i] = Config::DEFAULT_FAN_CURVE[i];
  }

  void apply(JsonDocument& doc) {
    JsonObject screen = doc["screen"];
    if (!screen.isNull()) {
      if (screen["locked"].is<const char*>()) lockedScreenOff = String(screen["locked"].as<const char*>()) == "off";
      if (screen["offline"].is<const char*>()) offlineFace = String(screen["offline"].as<const char*>()) == "face";
      if (screen["night_idle"].is<const char*>()) nightIdleOff = String(screen["night_idle"].as<const char*>()) == "off";
      if (screen["sleep_screen_off_ms"].is<unsigned long>()) {
        sleepScreenOffMs = constrain((unsigned long)screen["sleep_screen_off_ms"], 5000UL, Config::SLEEP_SCREEN_OFF_MS);
      }
    }
    JsonObject fan = doc["fan"];
    if (!fan.isNull()) {
      if (fan["mode"].is<const char*>()) fanMode = fan["mode"].as<const char*>();
      offlinePct = constrain((int)(fan["offline_pct"] | offlinePct), 0, 100);
      failsafePct = constrain((int)(fan["failsafe_pct"] | failsafePct), 0, 100);
      JsonArray arr = fan["curve"].as<JsonArray>();
      if (!arr.isNull()) {
        size_t n = 0;
        for (JsonVariant p : arr) {
          if (n >= 8 || !p.is<JsonArray>()) continue;
          JsonArray pair = p.as<JsonArray>();
          curve[n++] = { (int)(pair[0] | 0), constrain((int)(pair[1] | 0), 0, 100) };
        }
        if (n >= 2) curveLen = n;
      }
    }
  }
};

// ========================= FaceEngine =========================
class FaceEngine {
public:
  Mood mood = MOOD_SLEEP;
  Mood targetMood = MOOD_SLEEP;
  int intensity = 10;
  unsigned long step = 0;
  unsigned long moodSinceMs = 0;
  unsigned long lastHotMs = 0;
  int priority = 30;
  String reason = "boot";

  void updateDecision(const MacLink& mac, const RuntimeConfig& cfg, Mood sceneMood = MOOD_NORMAL, bool sceneActive = false) {
    Mood next = MOOD_NORMAL;
    int nextIntensity = 20;
    int nextPriority = 10;
    String nextReason = "normal";
    unsigned long now = millis();

    if (mac.tempValid() && mac.tempC >= 78) {
      next = MOOD_HOT;
      nextIntensity = map(constrain(mac.tempC, 78, 100), 78, 100, 65, 100);
      nextPriority = 100;
      nextReason = "hot_temp";
      lastHotMs = now;
    } else if (now - lastHotMs < Config::HOT_COOLDOWN_MS && mac.tempValid() && mac.tempC >= 70) {
      next = MOOD_HOT;
      nextIntensity = 60;
      nextPriority = 95;
      nextReason = "hot_cooldown";
    } else if (!mac.macAvailable()) {
      next = MOOD_OFFLINE;
      nextIntensity = mac.longOffline() ? 20 : 55;
      nextPriority = 80;
      nextReason = mac.longOffline() ? "mac_offline_long" : "mac_state_stale";
    } else if (mac.locked) {
      next = MOOD_SLEEP;
      nextIntensity = 10;
      nextPriority = 75;
      nextReason = "mac_locked";
    } else if (cfg.nightIdleOff && isNight(mac.timeText) && mac.idleS >= (int)Config::IDLE_SLEEPY_S) {
      next = MOOD_SLEEPY;
      nextIntensity = 12;
      nextPriority = 60;
      nextReason = "night_idle";
    } else if (sceneActive && (sceneMood == MOOD_THINKING || sceneMood == MOOD_READING || sceneMood == MOOD_REPLYING)) {
      next = sceneMood;
      nextIntensity = 55;
      nextPriority = 55;
      nextReason = moodName(sceneMood);
    } else if (mac.cpuPct >= 88 || mac.memPct >= 92) {
      next = MOOD_POWER;
      nextIntensity = max(mac.cpuPct, mac.memPct);
      nextPriority = 45;
      nextReason = "load_power";
    } else if (mac.cpuPct >= 65 || mac.memPct >= 78) {
      next = MOOD_BUSY;
      nextIntensity = max(mac.cpuPct, mac.memPct);
      nextPriority = 40;
      nextReason = "load_busy";
    } else if (mac.idleS >= (int)Config::IDLE_SLEEPY_S) {
      next = MOOD_SLEEPY;
      nextIntensity = 18;
      nextPriority = 35;
      nextReason = "idle_10m";
    } else if (mac.idleS >= 180) {
      next = MOOD_IDLE;
      nextIntensity = 20;
      nextPriority = 25;
      nextReason = "idle";
    } else if (isDevApp(mac.app) || String(mac.modeHint) == "focus" || mac.cpuPct >= 35) {
      next = MOOD_FOCUS;
      nextIntensity = max(35, mac.cpuPct);
      nextPriority = 20;
      nextReason = "dev_focus";
    } else {
      next = MOOD_HAPPY;
      nextIntensity = max(15, mac.cpuPct);
      nextPriority = 10;
      nextReason = "active_happy";
    }

    if (next != targetMood) {
      targetMood = next;
    }
    if (next != mood && (now - moodSinceMs >= Config::MOOD_HOLD_MS || nextPriority > priority)) {
      mood = next;
      step = 0;
      moodSinceMs = now;
    }
    intensity = constrain(nextIntensity, 0, 100);
    priority = nextPriority;
    reason = nextReason;
  }

  bool isSleepFamily() const {
    return mood == MOOD_SLEEP || mood == MOOD_SLEEPY || mood == MOOD_OFFLINE;
  }

  void draw(DisplayEngine& display) {
    if (!display.screenOn) return;
    display.beginFaceFrame();
    U8G2& o = display.oled;
    int bob = (step % 18 < 9) ? 0 : 1;
    bool blink = isBlinkFrame();
    int cy = 24 + bob;

