kairkiss/mac-esp32-console/esp32/bkb_desk_pet_v6_lite/bkb_desk_pet_v6_lite.ino
    if (step < 4) drawWakeBlink(o, step);
    else {
      switch (mood) {
        case MOOD_NORMAL: drawNormal(o, bob, blink); break;
        case MOOD_HAPPY: drawHappy(o, bob, blink); break;
        case MOOD_FOCUS: drawFocus(o, blink); break;
        case MOOD_BUSY: drawBusy(o, blink); break;
        case MOOD_POWER: drawPower(o); break;
        case MOOD_HOT: drawHot(o, blink); break;
        case MOOD_IDLE: drawIdle(o, cy, blink); break;
        case MOOD_SLEEPY: drawSleepy(o, cy); break;
        case MOOD_SLEEP: drawSleep(o, cy); break;
        case MOOD_OFFLINE: drawOffline(o); break;
        case MOOD_THINKING: drawThinking(o, blink); break;
        case MOOD_READING: drawReading(o, blink); break;
        case MOOD_REPLYING: drawReplying(o, blink); break;
        case MOOD_CONFUSED: drawConfused(o); break;
      }
    }

    display.endFaceFrame();
    step++;
  }

private:
  bool isNight(const String& t) const {
    if (t.length() < 2) return false;
    int h = t.substring(0, 2).toInt();
    return h >= 23 || h < 8;
  }

  bool isDevApp(const String& app) const {
    String a = app;
    a.toLowerCase();
    return a.indexOf("terminal") >= 0 || a.indexOf("code") >= 0 || a.indexOf("xcode") >= 0 ||
           a.indexOf("arduino") >= 0 || a.indexOf("node-red") >= 0 || a.indexOf("codex") >= 0;
  }

  bool isBlinkFrame() const {
    int period = (mood == MOOD_FOCUS || mood == MOOD_BUSY || mood == MOOD_POWER) ? 28 : 42;
    return step % period == 0 || step % period == 1;
  }

  void closedEyes(U8G2& o, int y) {
    o.drawLine(28, y, 52, y);
    o.drawLine(76, y, 100, y);
  }

  void softEyes(U8G2& o, int y, int dx) {
    o.drawRFrame(28, y - 10, 24, 18, 6);
    o.drawRFrame(76, y - 10, 24, 18, 6);
    o.drawDisc(40 + dx, y, 3);
    o.drawDisc(88 + dx, y, 3);
  }

  void halfEyes(U8G2& o, int y, int dx) {
    o.drawLine(28, y - 3, 52, y - 3);
    o.drawLine(30, y + 4, 50, y + 4);
    o.drawLine(76, y - 3, 100, y - 3);
    o.drawLine(78, y + 4, 98, y + 4);
    o.drawDisc(40 + dx, y + 2, 2);
    o.drawDisc(88 + dx, y + 2, 2);
  }

  void happyEyes(U8G2& o, int y) {
    o.drawLine(28, y + 7, 34, y);
    o.drawLine(34, y, 46, y);
    o.drawLine(46, y, 52, y + 7);
    o.drawLine(76, y + 7, 82, y);
    o.drawLine(82, y, 94, y);
    o.drawLine(94, y, 100, y + 7);
  }

  void smile(U8G2& o, int big) {
    if (big) {
      o.drawLine(44, 42, 50, 50);
      o.drawLine(50, 50, 58, 54);
      o.drawLine(58, 54, 70, 54);
      o.drawLine(70, 54, 78, 50);
      o.drawLine(78, 50, 84, 42);
    } else {
      o.drawLine(56, 47, 63, 50);
      o.drawLine(63, 50, 72, 47);
    }
  }

  void sweat(U8G2& o) {
    int fall = step % 8;
    o.drawLine(108, 12 + fall, 113, 22 + fall);
    o.drawLine(113, 22 + fall, 108, 28 + fall);
  }

  void drawWakeBlink(U8G2& o, unsigned long phase) {
    int y = 25;
    if (phase < 2) closedEyes(o, y);
    else {
      o.drawLine(28, y - 3, 52, y - 3);
      o.drawLine(76, y - 3, 100, y - 3);
      o.drawPixel(40, y);
      o.drawPixel(88, y);
    }
  }

  void drawNormal(U8G2& o, int bob, bool blink) {
    if (blink) closedEyes(o, 25 + bob);
    else softEyes(o, 24 + bob, 0);
    smile(o, 0);
  }

  void drawSleep(U8G2& o, int cy) {
    closedEyes(o, cy);
    o.drawLine(55, 46, 73, 46);
    o.setFont(u8g2_font_6x12_tr);
    if (step % 20 < 10) o.drawStr(94, 53, "zZ");
    else o.drawStr(100, 48, "z");
  }

  void drawSleepy(U8G2& o, int cy) {
    halfEyes(o, cy, -1);
    o.drawLine(55, 48, 73, 48);
    o.setFont(u8g2_font_6x12_tr);
    if (step % 36 < 18) o.drawStr(101, 58, "...");
  }

  void drawHappy(U8G2& o, int bob, bool blink) {
    if (blink) closedEyes(o, 25 + bob);
    else happyEyes(o, 20 + bob);
    smile(o, intensity > 25);
    if (step % 12 < 6) {
      o.drawPixel(20, 14); o.drawPixel(108, 15); o.drawPixel(18, 17);
      o.drawLine(112, 8, 112, 12); o.drawLine(110, 10, 114, 10);
    }
  }

  void drawFocus(U8G2& o, bool blink) {
    if (blink) closedEyes(o, 25);
    else {
      o.drawLine(28, 20, 52, 20);
      o.drawLine(32, 29, 48, 29);
      o.drawLine(76, 20, 100, 20);
      o.drawLine(80, 29, 96, 29);
      o.drawDisc(42, 25, 2); o.drawDisc(90, 25, 2);
    }
    o.drawLine(53, 48, 75, 48);
    o.drawLine(15, 15, 24, 16); o.drawLine(104, 16, 113, 15);
  }

  void drawBusy(U8G2& o, bool blink) {
    int shake = (step % 6 == 0) ? 1 : 0;
    if (blink) closedEyes(o, 25);
    else {
      o.drawLine(29, 28 + shake, 51, 20 + shake);
      o.drawLine(77, 20 + shake, 99, 28 + shake);
      o.drawDisc(40, 28 + shake, 2); o.drawDisc(88, 28 + shake, 2);
    }
    o.drawLine(56, 49, 72, 44);
    if (intensity > 70) sweat(o);
  }

  void drawPower(U8G2& o) {
    int shake = (step % 2) ? 1 : -1;
    int y = 24 + shake;
    o.drawLine(27, y - 7, 52, y + 3);
    o.drawLine(29, y + 4, 50, y - 4);
    o.drawLine(76, y + 3, 101, y - 7);
    o.drawLine(78, y - 4, 99, y + 4);
    o.drawFrame(45, 40 + shake, 38, 14);
    o.drawLine(45, 47 + shake, 83, 47 + shake);
    o.drawLine(54, 40 + shake, 54, 54 + shake);
    o.drawLine(64, 40 + shake, 64, 54 + shake);
    o.drawLine(74, 40 + shake, 74, 54 + shake);
    sweat(o);
  }

  void drawIdle(U8G2& o, int cy, bool blink) {
    if (blink) closedEyes(o, cy);
    else {
      int dx = (step % 34 < 17) ? -4 : 4;
      softEyes(o, cy, dx);
    }
    if (step % 44 < 22) smile(o, 0);
    else o.drawLine(54, 48, 74, 48);
  }

  void drawHot(U8G2& o, bool blink) {
    int wave = (step % 4 < 2) ? 0 : 1;
    if (blink) closedEyes(o, 25);
    else {
      o.drawCircle(40, 24, 8);
      o.drawCircle(88, 24, 8);
      o.drawDisc(40, 27, 2);
      o.drawDisc(88, 27, 2);
    }
    o.drawLine(52, 49, 58, 45 + wave);
    o.drawLine(58, 45 + wave, 66, 49);
    o.drawLine(66, 49, 74, 45 + wave);
    sweat(o);
    o.drawLine(18, 13, 22, 20); o.drawLine(24, 13, 20, 20);
    o.drawLine(106, 12, 110, 19); o.drawLine(113, 12, 109, 19);
  }

  void drawOffline(U8G2& o) {
    int dx = (step % 28 < 14) ? -2 : 2;
    halfEyes(o, 24, dx);
    o.drawLine(54, 49, 74, 49);
    o.setFont(u8g2_font_6x12_tr);
    o.drawStr(47, 62, "offline");
    o.drawCircle(112, 16, 6); o.drawLine(108, 20, 116, 12);
  }

  void drawThinking(U8G2& o, bool blink) {
    if (blink) closedEyes(o, 25);
    else softEyes(o, 24, (step % 24 < 12) ? -2 : 2);
    o.drawLine(56, 49, 72, 49);
    int dots = (step / 5) % 4;
    for (int i = 0; i < dots; i++) o.drawDisc(53 + i * 10, 57, 2);
  }

  void drawReading(U8G2& o, bool blink) {
    if (blink) closedEyes(o, 24);
    else {
      o.drawRFrame(26, 15, 28, 18, 5); o.drawRFrame(74, 15, 28, 18, 5);
      o.drawDisc(45, 25, 2); o.drawDisc(93, 25, 2);
    }
    o.drawRFrame(46, 42, 36, 15, 3);
    o.drawLine(51, 47, 77, 47); o.drawLine(51, 52, 70, 52);
  }

  void drawReplying(U8G2& o, bool blink) {
    if (blink) closedEyes(o, 24);
    else happyEyes(o, 20);
    smile(o, 1);
    o.drawRFrame(82, 42, 34, 15, 4);
    o.drawLine(89, 48, 108, 48);
  }

  void drawConfused(U8G2& o) {
    o.drawCircle(40, 24, 8); o.drawLine(36, 20, 44, 28);
    o.drawCircle(88, 24, 8); o.drawDisc(88, 24, 2);
    o.drawLine(56, 49, 72, 51);
    o.setFont(u8g2_font_6x12_tr); o.drawStr(108, 16, "?");
  }
};

