kairkiss/mac-esp32-console/esp32/bkb_desk_pet_v6_lite/bkb_desk_pet_v6_lite.ino
// ========================= FanController =========================
class FanController {
public:
  int fanPct = 0;
  int targetPct = 0;
  unsigned long lastUpdateMs = 0;
  unsigned long spinUntilMs = 0;

  void begin() {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    ledcAttach(Config::FAN_PWM_PIN, Config::FAN_PWM_FREQ, Config::FAN_PWM_BITS);
#else
    ledcSetup(Config::FAN_PWM_CHANNEL, Config::FAN_PWM_FREQ, Config::FAN_PWM_BITS);
    ledcAttachPin(Config::FAN_PWM_PIN, Config::FAN_PWM_CHANNEL);
#endif
    writePct(0);
  }

  void update(const MacLink& mac, const RuntimeConfig& cfg, bool mqttConnected) {
    unsigned long now = millis();
    if (now - lastUpdateMs < Config::FAN_UPDATE_MS) return;
    lastUpdateMs = now;

    targetPct = decideTarget(mac, cfg, mqttConnected);

    if (targetPct > 0 && fanPct == 0 && spinUntilMs == 0) {
      spinUntilMs = now + 700;
      writePct(100);
      return;
    }
    if (spinUntilMs && now < spinUntilMs) {
      writePct(100);
      return;
    }
    spinUntilMs = 0;

    if (fanPct < targetPct) fanPct = min(targetPct, fanPct + 4);
    else if (fanPct > targetPct) fanPct = max(targetPct, fanPct - 3);
    writePct(fanPct);
  }

private:
  int decideTarget(const MacLink& mac, const RuntimeConfig& cfg, bool mqttConnected) {
    if (cfg.fanMode == "off") return 0;
    if (cfg.fanMode == "manual") return cfg.offlinePct;

    if (!mqttConnected && !mac.longOffline()) return cfg.failsafePct;
    if (!mac.macAvailable()) return mac.longOffline() ? cfg.offlinePct : cfg.failsafePct;
    if (!mac.stateFresh()) return cfg.failsafePct;

    if (mac.tempValid()) return fromCurve(mac.tempC, cfg);
    return cpuFallback(mac.cpuPct, cfg);
  }

  int fromCurve(int temp, const RuntimeConfig& cfg) {
    if (cfg.curveLen == 0) return 0;
    if (temp < cfg.curve[0].temp) return cfg.curve[0].pct;
    for (size_t i = 1; i < cfg.curveLen; i++) {
      if (temp < cfg.curve[i].temp) return cfg.curve[i].pct;
    }
    return cfg.curve[cfg.curveLen - 1].pct;
  }

  int cpuFallback(int cpu, const RuntimeConfig& cfg) {
    if (cpu >= 90) return max(75, cfg.failsafePct);
    if (cpu >= 75) return 65;
    if (cpu >= 60) return 45;
    if (cpu >= 40) return 25;
    return 0;
  }

  void writePct(int pct) {
    pct = constrain(pct, 0, 100);
    fanPct = pct;
    int duty = map(pct, 0, 100, 0, 255);
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    ledcWrite(Config::FAN_PWM_PIN, duty);
#else
    ledcWrite(Config::FAN_PWM_CHANNEL, duty);
#endif
  }
};

// ========================= SceneEngine =========================
enum SceneKind {
  SCENE_FACE,
  SCENE_TEXT,
  SCENE_BITMAP,
  SCENE_PAGES,
  SCENE_THINKING
};

class SceneEngine {
public:
  SceneKind kind = SCENE_FACE;
  unsigned long untilMs = 0;
  bool dirty = false;
  String text = "";
  String style = "full";
  String source = "";
  String bitmapId = "";
  uint8_t bitmap[Config::BITMAP_1BPP_BYTES];
  uint8_t pages[Config::MAX_BITMAP_PAGES][Config::BITMAP_1BPP_BYTES];
  bool pageReady[Config::MAX_BITMAP_PAGES] = {false};
  uint8_t pageCount = 0;
  uint8_t currentPage = 0;
  unsigned long pageDurationMs = Config::MIN_BITMAP_PAGE_MS;
  unsigned long nextPageMs = 0;

  const char* sceneName() const {
    if (kind == SCENE_TEXT && millis() < untilMs) return "text";
    if (kind == SCENE_BITMAP && millis() < untilMs) return "bitmap";
    if (kind == SCENE_PAGES && millis() < untilMs) return "pages";
    if (kind == SCENE_THINKING && millis() < untilMs) return "thinking";
    return "face";
  }

  Mood sceneMood() const {
    if (kind == SCENE_THINKING) return MOOD_THINKING;
    if (kind == SCENE_TEXT) return MOOD_READING;
    if (kind == SCENE_BITMAP || kind == SCENE_PAGES) return source == "deepseek" ? MOOD_REPLYING : MOOD_READING;
    return MOOD_NORMAL;
  }

  bool active(unsigned long now) {
    expire(now);
    return kind != SCENE_FACE;
  }

  void cancel() {
    kind = SCENE_FACE;
    untilMs = 0;
    dirty = false;
    pageCount = 0;
    currentPage = 0;
  }

  void showText(const String& value, unsigned long durationMs, const String& styleName, const String& sourceName) {
    text = value.substring(0, 240);
    style = styleName.length() ? styleName : "full";
    source = sourceName;
    untilMs = millis() + clampDuration(durationMs);
    kind = SCENE_TEXT;
    dirty = true;
  }

  bool showBitmapBase64(const String& id, const char* data, unsigned long durationMs, const String& sourceName = "console") {
    if (!data || strlen(data) == 0) return false;
    size_t decodedLen = 0;
    int rc = mbedtls_base64_decode(
      bitmap,
      sizeof(bitmap),
      &decodedLen,
      reinterpret_cast<const unsigned char*>(data),
      strlen(data)
    );
    if (rc != 0 || decodedLen != sizeof(bitmap)) return false;

    bitmapId = id;
    source = sourceName;
    pageDurationMs = clampBitmapDuration(durationMs);
    untilMs = millis() + pageDurationMs;
    kind = SCENE_BITMAP;
    dirty = true;
    return true;
  }

  void showThinking(unsigned long durationMs, const String& sourceName) {
    source = sourceName;
    untilMs = millis() + clampDuration(durationMs);
    kind = SCENE_THINKING;
    dirty = true;
  }

  bool addBitmapPageBase64(const String& batchId, uint8_t pageIndex, uint8_t totalPages, const char* data, unsigned long durationMs, const String& sourceName) {
    if (!data || totalPages == 0 || totalPages > Config::MAX_BITMAP_PAGES || pageIndex >= totalPages) return false;
    size_t decodedLen = 0;
    int rc = mbedtls_base64_decode(
      pages[pageIndex],
      Config::BITMAP_1BPP_BYTES,
      &decodedLen,
      reinterpret_cast<const unsigned char*>(data),
      strlen(data)
    );
    if (rc != 0 || decodedLen != Config::BITMAP_1BPP_BYTES) return false;
    if (batchId != bitmapId || pageCount != totalPages) {
      bitmapId = batchId;
      pageCount = totalPages;
      currentPage = 0;
      for (uint8_t i = 0; i < Config::MAX_BITMAP_PAGES; i++) pageReady[i] = false;
    }
    pageReady[pageIndex] = true;
    source = sourceName;
    pageDurationMs = clampBitmapDuration(durationMs);
    if (allPagesReady()) {
      kind = SCENE_PAGES;
      untilMs = millis() + pageDurationMs * pageCount;
      nextPageMs = millis() + pageDurationMs;
      currentPage = 0;
      dirty = true;
    }
    return true;
  }

  bool shouldYieldToFace(Mood mood) const {
    return kind != SCENE_FACE &&
      (mood == MOOD_HOT || mood == MOOD_SLEEP || mood == MOOD_OFFLINE);
  }

  bool render(DisplayEngine& display, unsigned long now) {
    expire(now);
    if (kind == SCENE_FACE) return false;
    if (kind == SCENE_PAGES && now >= nextPageMs && currentPage + 1 < pageCount) {
      currentPage++;
      nextPageMs = now + pageDurationMs;
      dirty = true;
    }
    if (kind == SCENE_THINKING) dirty = true;
    if (!dirty) return true;

    display.setScreen(true);
    if (kind == SCENE_TEXT) {
      display.drawConsoleText(text, style);
    } else if (kind == SCENE_BITMAP) {
      display.drawBitmap1bpp(bitmap);
    } else if (kind == SCENE_PAGES) {
      display.drawBitmap1bpp(pages[currentPage]);
    } else if (kind == SCENE_THINKING) {
      drawThinkingScene(display, now);
    }
    dirty = false;
    return true;
  }

