kairkiss/mac-esp32-console/esp32/bkb_desk_pet_v6_lite/bkb_desk_pet_v6_lite.ino
private:
  unsigned long clampDuration(unsigned long durationMs) const {
    if (durationMs == 0) return Config::SCENE_DEFAULT_MS;
    return constrain(durationMs, 500UL, 30000UL);
  }

  unsigned long clampBitmapDuration(unsigned long durationMs) const {
    if (durationMs < Config::MIN_BITMAP_PAGE_MS) return Config::MIN_BITMAP_PAGE_MS;
    return constrain(durationMs, Config::MIN_BITMAP_PAGE_MS, 30000UL);
  }

  bool allPagesReady() const {
    if (pageCount == 0) return false;
    for (uint8_t i = 0; i < pageCount; i++) if (!pageReady[i]) return false;
    return true;
  }

  void drawThinkingScene(DisplayEngine& display, unsigned long now) {
    if (!display.screenOn) return;
    display.oled.clearBuffer();
    display.oled.setFont(u8g2_font_6x12_tr);
    display.oled.drawStr(28, 18, "thinking");
    int dots = (now / 350) % 4;
    for (int i = 0; i < dots; i++) display.oled.drawDisc(47 + i * 10, 35, 2);
    display.oled.drawCircle(64, 48, 8);
    display.oled.sendBuffer();
  }

  void expire(unsigned long now) {
    if (kind != SCENE_FACE && (long)(now - untilMs) >= 0) cancel();
  }
};

// ========================= ScreenPolicy =========================
class ScreenPolicy {
public:
  bool screenOn = true;
  unsigned long inactiveSinceMs = 0;
  unsigned long manualOffUntilMs = 0;
  String offReason = "";

  void update(DisplayEngine& display, const FaceEngine& face, const SceneEngine& scene, const RuntimeConfig& cfg, const MacLink& mac, bool fanFailsafe) {
    unsigned long now = millis();
    bool forceOn = scene.kind != SCENE_FACE || face.mood == MOOD_HOT || fanFailsafe;
    bool sleepish = face.isSleepFamily();

    if (manualOffUntilMs && (long)(now - manualOffUntilMs) < 0 && !forceOn) {
      offReason = "manual_screen_off";
      set(display, false);
      return;
    }
    if (manualOffUntilMs && (long)(now - manualOffUntilMs) >= 0) {
      manualOffUntilMs = 0;
    }

    if (!sleepish || forceOn) {
      inactiveSinceMs = 0;
      offReason = "";
      set(display, true);
      return;
    }

    if (inactiveSinceMs == 0) inactiveSinceMs = now;
    if (now - inactiveSinceMs >= cfg.sleepScreenOffMs) {
      if (mac.locked) offReason = "locked_sleep_timeout";
      else if (!mac.macAvailable()) offReason = "offline_timeout";
      else offReason = "idle_sleep_timeout";
      set(display, false);
    } else {
      offReason = "";
      set(display, true);
    }
  }

  unsigned long inactiveAgeMs() const {
    return inactiveSinceMs ? millis() - inactiveSinceMs : 0;
  }

  void wake(DisplayEngine& display) {
    manualOffUntilMs = 0;
    inactiveSinceMs = 0;
    offReason = "";
    set(display, true);
  }

  void requestManualOff(DisplayEngine& display, unsigned long durationMs = 300000UL) {
    manualOffUntilMs = millis() + durationMs;
    inactiveSinceMs = millis();
    offReason = "manual_screen_off";
    set(display, false);
  }

private:
  void set(DisplayEngine& display, bool on) {
    screenOn = on;
    display.setScreen(on);
  }
};

extern DisplayEngine display;

// ========================= ConfigPortal =========================
class ConfigPortal {
public:
  WebServer server;
  bool active = false;
  bool otaActive = false;
  unsigned long otaLastMs = 0;
  size_t otaTotal = 0;

  ConfigPortal() : server(80) {}

  void begin(NetworkConfig& cfg, DisplayEngine& display) {
    if (active) return;
    WiFi.mode(WIFI_AP_STA);
    WiFi.softAP(Config::CONFIG_AP_SSID, Config::CONFIG_AP_PASS);
    active = true;
    bindRoutes(cfg);
    server.begin();
    display.setScreen(true);
    display.drawText("Config AP", Config::CONFIG_AP_SSID, "192.168.4.1", "pass macesp32");
    Serial.printf("Config portal active: ssid=%s ip=%s\n", Config::CONFIG_AP_SSID, WiFi.softAPIP().toString().c_str());
  }

  void loop() {
    if (active) server.handleClient();
  }

private:
  String otaStatusJson() {
    StaticJsonDocument<384> doc;
    size_t sketchSize = ESP.getSketchSize();
    size_t freeSpace = ESP.getFreeSketchSpace();
    bool supported = freeSpace > 0;
    doc["ok"] = true;
    doc["fw"] = Config::FW_NAME;
    doc["fw_version"] = Config::FW_VERSION;
    doc["free_heap"] = ESP.getFreeHeap();
    doc["sketch_size"] = sketchSize;
    doc["free_sketch_space"] = freeSpace;
    doc["ota_supported"] = supported;
    doc["reason"] = supported ? "ok" : "no_ota_partition_or_no_free_sketch_space";
    char out[384];
    size_t n = serializeJson(doc, out);
    return String(out).substring(0, n);
  }

  void bindRoutes(NetworkConfig& cfg) {
    server.on("/", HTTP_GET, [&cfg, this]() {
      String html = "<!doctype html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'>"
                    "<style>body{font-family:-apple-system,BlinkMacSystemFont,sans-serif;margin:28px;background:#111;color:#f5f5f7}"
                    "input,button{font:inherit;width:100%;box-sizing:border-box;margin:8px 0;padding:12px;border-radius:10px;border:0}"
                    "button{background:#0a84ff;color:white}.card{max-width:420px;margin:auto}</style></head><body><div class='card'>"
                    "<h2>Mac-esp32 Setup</h2><form method='post' action='/config'>"
                    "<input name='ssid' placeholder='Wi-Fi SSID' value='" + cfg.wifiSsid + "'>"
                    "<input name='pass' placeholder='Wi-Fi Password' type='password'>"
                    "<input name='mqtt' placeholder='Mac MQTT IP' value='" + cfg.mqttHost + "'>"
                    "<input name='port' placeholder='MQTT Port' value='" + String(cfg.mqttPort) + "'>"
                    "<button>Save & Restart</button></form></div></body></html>";
      server.send(200, "text/html", html);
    });
    server.on("/status", HTTP_GET, [&cfg, this]() {
      StaticJsonDocument<256> doc;
      doc["ok"] = true;
      doc["ssid"] = cfg.wifiSsid;
      doc["mqtt_host"] = cfg.mqttHost;
      doc["mqtt_port"] = cfg.mqttPort;
      doc["ap_ssid"] = Config::CONFIG_AP_SSID;
      char out[256];
      size_t n = serializeJson(doc, out);
      server.send(200, "application/json", String(out).substring(0, n));
    });
    server.on("/ota/status", HTTP_GET, [this]() {
      server.sendHeader("Access-Control-Allow-Origin", "*");
      server.send(200, "application/json", otaStatusJson());
    });
    server.on("/ota/upload", HTTP_OPTIONS, [this]() {
      server.sendHeader("Access-Control-Allow-Origin", "*");
      server.sendHeader("Access-Control-Allow-Headers", "content-type,x-firmware-name,x-ota-token");
      server.send(204);
    });
    server.on("/ota/upload", HTTP_POST, [this]() {
      server.sendHeader("Access-Control-Allow-Origin", "*");
      if (Update.hasError()) {
        display.setScreen(true);
        display.drawText("OTA FAIL", String(Update.getError()), "current fw kept", "");
        server.send(500, "application/json", "{\"ok\":false,\"error\":\"update_failed\"}");
      } else {
        display.setScreen(true);
        display.drawText("OTA", "REBOOTING", "", "");
        server.send(200, "application/json", "{\"ok\":true,\"rebooting\":true}");
        delay(600);
        ESP.restart();
      }
      otaActive = false;
    }, [this]() {
      HTTPUpload& upload = server.upload();
      if (upload.status == UPLOAD_FILE_START) {
        otaActive = true;
        otaTotal = 0;
        otaLastMs = millis();
        display.setScreen(true);
        display.drawText("OTA READY", "UPDATING", "0%", "");
        size_t freeSpace = ESP.getFreeSketchSpace();
        if (freeSpace == 0 || !Update.begin(freeSpace)) {
          display.drawText("OTA FAIL", "no ota space", "", "");
        }
      } else if (upload.status == UPLOAD_FILE_WRITE) {
        if (!Update.hasError()) {
          size_t written = Update.write(upload.buf, upload.currentSize);
          otaTotal += written;
          if (millis() - otaLastMs > 350) {
            otaLastMs = millis();
            int pct = ESP.getFreeSketchSpace() > 0 ? min(99, (int)((otaTotal * 100UL) / ESP.getFreeSketchSpace())) : 0;
            display.drawText("OTA UPDATE", "UPDATING", String(pct) + "%", "");
          }
        }
      } else if (upload.status == UPLOAD_FILE_END) {
        display.drawText("OTA UPDATE", "VERIFYING", String(otaTotal) + " bytes", "");
        if (!Update.end(true)) {
          display.drawText("OTA FAIL", String(Update.getError()), "current fw kept", "");
        }
      } else if (upload.status == UPLOAD_FILE_ABORTED) {
        Update.abort();
        otaActive = false;
        display.drawText("OTA FAIL", "aborted", "current fw kept", "");
      }
    });
    server.on("/config", HTTP_OPTIONS, [this]() {
      server.sendHeader("Access-Control-Allow-Origin", "*");
      server.sendHeader("Access-Control-Allow-Headers", "content-type");
      server.send(204);
    });
    server.on("/config", HTTP_POST, [&cfg, this]() {
      String ssid;
      String pass;
      String mqtt;
      int port = Config::MQTT_PORT;
      String body = server.arg("plain");
      body.trim();
      if (body.startsWith("{")) {
        StaticJsonDocument<512> doc;
        DeserializationError err = deserializeJson(doc, body);
        if (err) {
          server.sendHeader("Access-Control-Allow-Origin", "*");
          server.send(400, "application/json", "{\"ok\":false,\"error\":\"bad_json\"}");
          return;
        }
        ssid = doc["ssid"] | "";
        pass = doc["password"] | doc["pass"] | "";
        mqtt = doc["mqtt_host"] | doc["mqtt"] | "";
        port = doc["mqtt_port"] | doc["port"] | Config::MQTT_PORT;
      } else {
        ssid = server.arg("ssid");
        pass = server.arg("pass");
        if (pass.length() == 0) pass = server.arg("password");
        mqtt = server.arg("mqtt");
        if (mqtt.length() == 0) mqtt = server.arg("mqtt_host");
        String portArg = server.arg("port");
        if (portArg.length() == 0) portArg = server.arg("mqtt_port");
        port = portArg.toInt();
      }
      ssid.trim();
      mqtt.trim();
      if (ssid.length() == 0 || mqtt.length() == 0) {
        server.sendHeader("Access-Control-Allow-Origin", "*");
        server.send(400, "application/json", "{\"ok\":false,\"error\":\"missing_ssid_or_mqtt_host\"}");
        return;
      }
      cfg.save(ssid, pass, mqtt, port);
      server.sendHeader("Access-Control-Allow-Origin", "*");
      server.send(200, "application/json", "{\"ok\":true,\"restarting\":true}");
      delay(500);
      ESP.restart();
    });
  }
};

// ========================= Globals =========================
DisplayEngine display;
RuntimeConfig runtimeConfig;
NetworkConfig networkConfig;
MacLink macLink;
FaceEngine faceEngine;
FanController fanController;
SceneEngine sceneEngine;
ScreenPolicy screenPolicy;
ConfigPortal configPortal;
WiFiClient wifiClient;
PubSubClient mqttClient(wifiClient);

