kairkiss/mac-esp32-console/esp32/bkb_desk_pet_v6_lite/bkb_desk_pet_v6_lite.ino
unsigned long lastMqttAttemptMs = 0;
uint8_t mqttFailCount = 0;
unsigned long lastPetStateMs = 0;
unsigned long lastTelemetryMs = 0;
unsigned long lastLegacyOnlineMs = 0;
unsigned long lastFaceFrameMs = 0;
unsigned long lastNetworkHintMs = 0;

// ========================= MQTT Bridge =========================
const char* networkReason() {
  if (WiFi.status() != WL_CONNECTED) return "wifi_disconnected";
  if (!mqttClient.connected()) return mqttFailCount > 0 ? "mqtt_failed" : "mqtt_disconnected";
  if (!macLink.macAvailable()) return macLink.longOffline() ? "mac_offline" : "mac_stale";
  return "ok";
}

void publishPetState(bool retain) {
  StaticJsonDocument<1024> doc;
  doc["v"] = 1;
  doc["id"] = Config::DEVICE_ID;
  doc["fw"] = Config::FW_NAME;
  doc["fw_version"] = Config::FW_VERSION;
  doc["free_heap"] = ESP.getFreeHeap();
  doc["sketch_size"] = ESP.getSketchSize();
  doc["free_sketch_space"] = ESP.getFreeSketchSpace();
  doc["uptime_ms"] = millis();
  doc["ip"] = WiFi.localIP().toString();
  doc["rssi"] = WiFi.RSSI();
  doc["mqtt_host"] = networkConfig.mqttHost;
  doc["network_reason"] = networkReason();
  doc["config_portal"] = configPortal.active;
  doc["config_ap"] = Config::CONFIG_AP_SSID;
  doc["mac_link"] = macLink.macAvailable() ? "ok" : (macLink.longOffline() ? "offline" : "stale");
  doc["mood"] = moodName(faceEngine.mood);
  doc["current_mood"] = moodName(faceEngine.mood);
  doc["scene"] = sceneEngine.sceneName();
  doc["current_scene"] = sceneEngine.sceneName();
  doc["mood_reason"] = faceEngine.reason;
  doc["priority"] = faceEngine.priority;
  doc["screen_on"] = display.screenOn;
  doc["inactive_age_ms"] = screenPolicy.inactiveAgeMs();
  doc["screen_off_reason"] = screenPolicy.offReason;
  doc["fan_pct"] = fanController.fanPct;
  doc["last_mac_state_age_ms"] = macLink.stateAgeMs();
  doc["temp_c_seen"] = macLink.tempValid() ? macLink.tempC : -1;
  doc["mqtt_connected"] = mqttClient.connected();
  char buf[1024];
  size_t n = serializeJson(doc, buf);
  mqttClient.publish("bkb/desk1/pet/state", (const uint8_t*)buf, n, retain);
}

void publishLegacyOnline(const char* status) {
  mqttClient.publish("bkb/desk1/state/online", status, true);
}

void publishTelemetry() {
  StaticJsonDocument<1024> doc;
  doc["v"] = 1;
  doc["id"] = Config::DEVICE_ID;
  doc["fw"] = Config::FW_NAME;
  doc["fw_version"] = Config::FW_VERSION;
  doc["uptime_ms"] = millis();
  doc["heap"] = ESP.getFreeHeap();
  doc["free_heap"] = ESP.getFreeHeap();
  doc["sketch_size"] = ESP.getSketchSize();
  doc["free_sketch_space"] = ESP.getFreeSketchSpace();
  doc["ip"] = WiFi.localIP().toString();
  doc["rssi"] = WiFi.RSSI();
  doc["mqtt_host"] = networkConfig.mqttHost;
  doc["network_reason"] = networkReason();
  doc["mqtt_connected"] = mqttClient.connected();
  doc["config_portal"] = configPortal.active;
  doc["config_ap"] = Config::CONFIG_AP_SSID;
  doc["mood"] = moodName(faceEngine.mood);
  doc["current_mood"] = moodName(faceEngine.mood);
  doc["scene"] = sceneEngine.sceneName();
  doc["current_scene"] = sceneEngine.sceneName();
  doc["mood_reason"] = faceEngine.reason;
  doc["priority"] = faceEngine.priority;
  doc["screen_on"] = display.screenOn;
  doc["inactive_age_ms"] = screenPolicy.inactiveAgeMs();
  doc["screen_off_reason"] = screenPolicy.offReason;
  doc["fan_pct"] = fanController.fanPct;
  doc["last_mac_state_age_ms"] = macLink.stateAgeMs();
  doc["temp_c_seen"] = macLink.tempValid() ? macLink.tempC : -1;
  char buf[1024];
  size_t n = serializeJson(doc, buf);
  mqttClient.publish("bkb/desk1/pet/telemetry", (const uint8_t*)buf, n, false);
}

void handleCompatTopic(const String& topic, JsonDocument& doc) {
  if (topic == "bkb/desk1/desired/display") {
    String l0 = doc["l0"] | "";
    String l1 = doc["l1"] | "";
    String l2 = doc["l2"] | "";
    String l3 = doc["l3"] | "";
    sceneEngine.showText(l0 + "\n" + l1 + "\n" + l2 + "\n" + l3, Config::COMPAT_VIEW_MS, "full", "v5");
  } else if (topic == "bkb/desk1/desired/system") {
    // Parse safely, but v6 policy takes over on the next face tick.
    const char* screen = doc["screen"] | "";
    if (String(screen) == "on") display.setScreen(true);
    else if (String(screen) == "off" && !macLink.macAvailable()) display.setScreen(false);
  } else if (topic == "bkb/desk1/desired/face") {
    // v5 retained face is accepted but not applied as authority.
  }
}

void mqttCallback(char* rawTopic, byte* payload, unsigned int length) {
  String topic(rawTopic);
  StaticJsonDocument<4096> doc;
  DeserializationError err = deserializeJson(doc, payload, length);
  if (err) return;

  if (topic == "bkb/desk1/mac/state") {
    macLink.handleState(doc);
  } else if (topic == "bkb/desk1/mac/heartbeat") {
    macLink.handleHeartbeat(doc);
  } else if (topic == "bkb/desk1/pet/config") {
    runtimeConfig.apply(doc);
  } else if (topic == "bkb/desk1/cmd/text") {
    String text = doc["text"] | "";
    String style = doc["style"] | "full";
    String source = doc["source"] | "mqtt";
    unsigned long durationMs = (unsigned long)(doc["duration_ms"] | Config::SCENE_DEFAULT_MS);
    if (text.length()) {
      sceneEngine.showText(text, durationMs, style, source);
      publishPetState(true);
    }
  } else if (topic == "bkb/desk1/cmd/bitmap") {
    int w = doc["w"] | 0;
    int h = doc["h"] | 0;
    String format = doc["format"] | "";
    String encoding = doc["encoding"] | "";
    unsigned long durationMs = (unsigned long)(doc["duration_ms"] | Config::SCENE_DEFAULT_MS);
    const char* data = doc["data"] | "";
    String id = doc["id"] | "";
    String source = doc["source"] | "console";
    if (w == 128 && h == 64 && format == "1bpp" && encoding == "base64" &&
        sceneEngine.showBitmapBase64(id, data, durationMs, source)) {
      publishPetState(true);
    }
  } else if (topic == "bkb/desk1/cmd/bitmap/page") {
    int w = doc["w"] | 0;
    int h = doc["h"] | 0;
    String format = doc["format"] | "";
    String encoding = doc["encoding"] | "";
    unsigned long durationMs = (unsigned long)(doc["duration_ms"] | Config::MIN_BITMAP_PAGE_MS);
    const char* data = doc["data"] | "";
    String id = doc["id"] | "";
    String source = doc["source"] | "console";
    int pageIndex = doc["page_index"] | 0;
    int pageCount = doc["page_count"] | 0;
    if (w == 128 && h == 64 && format == "1bpp" && encoding == "base64" &&
        sceneEngine.addBitmapPageBase64(id, pageIndex, pageCount, data, durationMs, source)) {
      publishPetState(true);
    }
  } else if (topic == "bkb/desk1/cmd/scene") {
    String scene = doc["scene"] | "";
    String source = doc["source"] | "console";
    unsigned long durationMs = (unsigned long)(doc["duration_ms"] | Config::SCENE_DEFAULT_MS);
    if (scene == "thinking") {
      sceneEngine.showThinking(durationMs, source);
      publishPetState(true);
    }
  } else if (topic == "bkb/desk1/cmd/device") {
    String action = doc["action"] | "";
    if (action == "wake" || action == "screen_on") {
      screenPolicy.wake(display);
      sceneEngine.showText("Mac-esp32\nawake", 2500, "bubble", "device");
      publishPetState(true);
    } else if (action == "screen_off") {
      sceneEngine.cancel();
      screenPolicy.requestManualOff(display);
      publishPetState(true);
    } else if (action == "clear_scene") {
      sceneEngine.cancel();
      screenPolicy.wake(display);
      publishPetState(true);
    } else if (action == "test_pattern") {
      screenPolicy.wake(display);
      sceneEngine.showText("Mac-esp32\nTEST\n128x64", 6000, "full", "device");
      publishPetState(true);
    } else if (action == "config_portal") {
      configPortal.begin(networkConfig, display);
      publishPetState(true);
    } else if (action == "reboot") {
      publishPetState(true);
      delay(250);
      ESP.restart();
    }
  } else if (topic == "bkb/desk1/cmd/netconfig") {
    String ssid = doc["ssid"] | "";
    String pass = doc["password"] | "";
    String mqttHost = doc["mqtt_host"] | "";
    int mqttPort = doc["mqtt_port"] | Config::MQTT_PORT;
    networkConfig.save(ssid, pass, mqttHost, mqttPort);
    publishPetState(true);
    delay(250);
    ESP.restart();
  } else if (topic == "bkb/desk1/desired/system" || topic == "bkb/desk1/desired/face" || topic == "bkb/desk1/desired/display") {
    handleCompatTopic(topic, doc);
  }
}

bool connectMqtt() {
  String clientId = "bkb-desk-pet-v6-" + String((uint32_t)ESP.getEfuseMac(), HEX);
  Serial.printf("MQTT connecting to %s:%d\n", networkConfig.mqttHost.c_str(), networkConfig.mqttPort);
  if (!mqttClient.connect(clientId.c_str(), "bkb/desk1/state/online", 0, true, "offline")) {
    Serial.printf("MQTT connect failed state=%d\n", mqttClient.state());
    mqttFailCount++;
    display.setScreen(true);
    display.drawText("MQTT fail", networkConfig.mqttHost, String(networkConfig.mqttPort), "check Mac IP");
    if (mqttFailCount >= 3) configPortal.begin(networkConfig, display);
    return false;
  }
  mqttFailCount = 0;
  mqttClient.subscribe("bkb/desk1/mac/state");
  mqttClient.subscribe("bkb/desk1/mac/heartbeat");
  mqttClient.subscribe("bkb/desk1/pet/config");
  mqttClient.subscribe("bkb/desk1/cmd/text");
  mqttClient.subscribe("bkb/desk1/cmd/bitmap");
  mqttClient.subscribe("bkb/desk1/cmd/bitmap/page");
  mqttClient.subscribe("bkb/desk1/cmd/scene");
  mqttClient.subscribe("bkb/desk1/cmd/device");
  mqttClient.subscribe("bkb/desk1/cmd/netconfig");
  mqttClient.subscribe("bkb/desk1/desired/system");
  mqttClient.subscribe("bkb/desk1/desired/face");
  mqttClient.subscribe("bkb/desk1/desired/display");
  publishLegacyOnline("online");
  publishPetState(true);
  publishTelemetry();
  Serial.println("MQTT connected and v6 topics subscribed");
  return true;
}

void ensureWiFi() {
  if (WiFi.status() == WL_CONNECTED) return;
  WiFi.mode(configPortal.active ? WIFI_AP_STA : WIFI_STA);
  WiFi.begin(networkConfig.wifiSsid.c_str(), networkConfig.wifiPass.c_str());
  Serial.printf("WiFi connecting to %s\n", networkConfig.wifiSsid.c_str());
  display.drawText("WiFi", "Connecting", networkConfig.wifiSsid, "");
  unsigned long start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < 12000) {
    delay(250);
  }
  if (WiFi.status() == WL_CONNECTED) {
    Serial.printf("WiFi OK ip=%s rssi=%d\n", WiFi.localIP().toString().c_str(), WiFi.RSSI());
    display.drawText("WiFi OK", WiFi.localIP().toString(), "MQTT next", "");
  } else {
    Serial.println("WiFi failed; local fallback");
    display.drawText("Wi-Fi fail", networkConfig.wifiSsid, "Setup AP", Config::CONFIG_AP_SSID);
    configPortal.begin(networkConfig, display);
  }
}

