kairkiss/mac-esp32-console/esp32/bkb_desk_pet_v6_lite/bkb_desk_pet_v6_lite.ino
// ========================= Arduino lifecycle =========================
void setup() {
  Serial.begin(115200);
  delay(300);
  Serial.println("Mac-esp32 v6.4 control center boot");
  networkConfig.begin();
  Serial.printf("OLED CS=%d DC=%d RST=%d FAN_PWM_PIN=%d MQTT_HOST=%s\n",
                Config::OLED_CS, Config::OLED_DC, Config::OLED_RST,
                Config::FAN_PWM_PIN, networkConfig.mqttHost.c_str());
  runtimeConfig.begin();
  display.begin();
  fanController.begin();
  ensureWiFi();
  configPortal.begin(networkConfig, display);
  mqttClient.setServer(networkConfig.mqttHost.c_str(), networkConfig.mqttPort);
  mqttClient.setCallback(mqttCallback);
  mqttClient.setBufferSize(4096);
}

void loop() {
  unsigned long now = millis();
  configPortal.loop();
  if (configPortal.otaActive) {
    return;
  }

  if (WiFi.status() != WL_CONNECTED) ensureWiFi();
  if (WiFi.status() == WL_CONNECTED && !mqttClient.connected() && now - lastMqttAttemptMs > 2500) {
    lastMqttAttemptMs = now;
    connectMqtt();
  }
  if (mqttClient.connected()) mqttClient.loop();

  if (mqttClient.connected() && !macLink.macAvailable() && now - lastNetworkHintMs >= 15000) {
    lastNetworkHintMs = now;
    display.setScreen(true);
    display.drawText("Mac stale", "age ms", String(macLink.stateAgeMs()), "Node-RED?");
  }

  bool sceneCurrentlyActive = sceneEngine.active(now);
  faceEngine.updateDecision(macLink, runtimeConfig, sceneEngine.sceneMood(), sceneCurrentlyActive);
  if (sceneEngine.shouldYieldToFace(faceEngine.mood)) sceneEngine.cancel();

  fanController.update(macLink, runtimeConfig, mqttClient.connected());
  bool fanFailsafe = fanController.targetPct >= runtimeConfig.failsafePct && !macLink.longOffline();
  screenPolicy.update(display, faceEngine, sceneEngine, runtimeConfig, macLink, fanFailsafe);

  bool sceneActive = display.screenOn && sceneEngine.render(display, now);
  if (display.screenOn && !sceneActive && now - lastFaceFrameMs >= Config::FACE_FRAME_MS) {
    lastFaceFrameMs = now;
    faceEngine.draw(display);
  }

  if (mqttClient.connected() && now - lastLegacyOnlineMs >= Config::LEGACY_ONLINE_MS) {
    lastLegacyOnlineMs = now;
    publishLegacyOnline("online");
  }

  if (mqttClient.connected() && now - lastPetStateMs >= Config::PET_STATE_MS) {
    lastPetStateMs = now;
    publishPetState(true);
  }
  if (mqttClient.connected() && now - lastTelemetryMs >= Config::TELEMETRY_MS) {
    lastTelemetryMs = now;
    publishTelemetry();
  }
}
